Repository: openprocurement/openprocurement.relocation.tenders
Catalog: docs/source/locale/*/LC_MESSAGES/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Examples for Tender
uk: Приклад для закупівлі

source: Tender ownership change
uk: Зміна власника закупівлі

source: Let's view transfer example for tender.
uk: Переглянемо приклад зміни власника для закупівлі.

source: Tender creation
uk: Створення закупівлі

source: At first let's create a tender:
uk: Спочатку створимо закупівлю:

source: `broker` is current tender's ``owner``.
uk: Майданчик `broker` є поточним власником ``owner`` закупівлі.

source: Note that response's `access` section contains a ``transfer`` key which is used to change tender ownership.
uk: Зверніть увагу, що секція відповіді `access` містить ключ ``transfer``, який використовується для зміни власника закупівлі.

source: After tender's registration in CDB broker has to provide its customer with ``transfer`` key.
uk: Після реєстрація закупівлі в ЦБД майданчик повинен довести ключ ``transfer`` до відома клієнта.

source: Transfer creation
uk: Ініціація зміни власника

source: Broker that is going to become new tender owner should create a `Transfer`.
uk: Майданчик, що стане новим власником закупівлі, повинен створити об'єкт `Transfer`.

source: `Transfer` object contains new access ``token`` and new ``transfer`` token for the object that will be transferred to new broker.
uk: Об'єкт `Transfer` містить новий ключ доступу до закупівлі ``token`` та новий ключ ``transfer`` для об'єкта, власник якого буде змінений.

source: `Transfer` can be retrieved by `id`:
uk: Об'єкт `Transfer` можна переглянути за допомогою ідентифікатора `id`:

source: Changing tender's owner
uk: Зміна власника закупівлі

source: Pay attention that only broker with appropriate accreditation level can become new owner. Otherwise broker will be forbidden from this action.
uk: Зверніть увагу, що тільки майданчик з відповідним рівнем акредитації може стати новим власником. В іншому випадку майданчику така дія буде заборонена.

source: To change tender's ownership new broker should send POST request to appropriate `/tenders/id/` with `data` section containing ``id`` of `Transfer` and ``transfer`` token received from customer:
uk: Щоб змінити власника закупівлі новий майданчик повинен надіслати POST запит на відповідний `/tenders/id/` з секцією `data`, що міститиме ідентифікатор ``id`` для `Transfer` та ключ ``transfer`` отриманий від клієнта:

source: Updated ``owner`` value indicates that ownership is successfully changed.
uk: Оновлене значення властивості ``owner`` вказує, що власник закупівлі був успішно змінений.

source: Note that new broker has to provide its customer with new ``transfer`` key (generated in `Transfer` object).
uk: Зверніть увагу, що новий майданчик повинен довести до відома клієнта новий ключ ``transfer`` (згенерований в об'єкті `Transfer`).

source: After `Transfer` is applied it stores tender path in ``usedFor`` property:
uk: ПІсля того, як об'єкт `Transfer` було застосовано, для нього генерується властивість ``usedFor`` (вказується шлях до об'єкта, власника якого було змінено):

source: 'Used' `Transfer` can't be applied to any other object.
uk: 'Використаний' об'єкт `Transfer` вже не можна застосувати до іншого об'єкта.

source: Let's try to change the tender using ``token`` received on `Transfer` creation:
uk: Спробуємо змінити закупівлю за допомогою ключа ``token``, отриманого при створенні об'єкта `Transfer`.

source: Bid ownership change
uk: Зміна власника пропозиції

source: Let's submit a bid via current broker:
uk: Подамо пропозицію через поточний майданчик:

source: Response contains `access` section with a ``transfer`` key that can be used to change bid ownership.
uk: Відповідь містить секцію `access` з ключем ``transfer``, який може бути використаним для зміни власника пропозиції.

source: Current broker has to provide its customer with ``transfer`` key for the bid. Then customer can pass it to new broker.
uk: Поточний майданчик повинен довести ключ пропозиції ``transfer`` до відома клієнта. Тоді клієнт зможе передати його новому майданчику.

source: Note that each `Transfer` can be applied only once. New broker (that is going to become new bid owner) should create separate `Transfer` for each owner change:
uk: Зверніть увагу, що кожен об'єкт `Transfer` можна застосувати лише один раз. Новий майданчик (що стане новим власником пропозиції) повинен створювати об'єкт `Transfer` для кожної зміни власника:

source: `Transfer` object contains new access ``token`` and new ``transfer`` key for the object that will be transferred to new broker.
uk: Об'єкт `Transfer` містить новий ключ доступу ``token`` та новий ключ ``transfer`` для об'єкта, власник якого буде змінений.

source: Changing bid's owner
uk: Зміна власника пропозиції

source: New broker should send POST request to appropriate `/tenders/id/bids/id` with `data` section containing ``id`` of `Transfer` and ``transfer`` key for the bid received from customer:
uk: Новий майданчик повинен надіслати POST запит на відповідний `/tenders/id/bids/id` з секцією `data`, що міститиме ідентифікатор ``id`` для об'єкта `Transfer` та ключ пропозиції ``transfer`` отриманий від клієнта:

source: Now new broker became bid owner. Check whether new owner is able to change the bid:
uk: Тепер новий майданчик став власником пропозиції. Варто перевірити, чи новий власник може змінити пропозицію:

source: New broker should provide its customer with new ``transfer`` key (received within `Transfer` object).
uk: Новий майданчик повинен довести до відома клієнта новий ключ ``transfer`` (отриманий з об'єкта `Transfer`).

source: Check whether `Transfer` object has successfully stored bid path in ``usedFor`` property:
uk: Можна перевірити чи об'єкт `Transfer` успішно зберіг шлях до пропозиції у властивості ``usedFor``:

source: Complaint ownership change
uk: Зміна власника скарги

source: Let's submit a complaint via current broker:
uk: Подамо скаргу через поточний майданчик:

source: Response contains `access` section with a ``transfer`` key that can be used to change complaint ownership.
uk: Відповідь містить секцію `access` з ключем ``transfer``, який може бути використаним для зміни власника скарги.

source: Current broker has to provide its customer with ``transfer`` key for the complaint. Then customer can pass it to new broker.
uk: Поточний майданчик повинен довести ключ скарги ``transfer`` до відома клієнта. Тоді клієнт зможе передати його новому майданчику.

source: Note that each `Transfer` can be applied only once. New broker (that is going to become new complaint owner) should create separate `Transfer` for each owner change:
uk: Зверніть увагу, що кожен об'єкт `Transfer` можна застосувати лише один раз. Новий майданчик (що стане новим власником скарги) повинен створювати об'єкт `Transfer` для кожної зміни власника:

source: Changing complaint's owner
uk: Зміна власника скарги

source: New broker should send POST request to appropriate `/tenders/id/complaints/id` with `data` section containing ``id`` of `Transfer` and ``transfer`` key for the complaint received from customer:
uk: Новий майданчик повинен надіслати POST запит на відповідний `/tenders/id/complaints/id` з секцією `data`, що міститиме ідентифікатор ``id`` для об'єкта `Transfer` та ключ скарги ``transfer`` отриманий від клієнта:

source: Now new broker became complaint owner. Check whether new owner is able to change the complaint:
uk: Тепер новий майданчик став власником скарги. Варто перевірити, чи новий власник може змінити цю скаргу:

source: Check whether `Transfer` object has successfully stored complaint path in ``usedFor`` property:
uk: Можна перевірити чи об'єкт `Transfer` успішно зберіг шлях до скарги у властивості ``usedFor``:

source: Award complaint ownership change
uk: Зміна власника скарги на визначення переможця

source: Let's submit a award complaint via current broker:
uk: Подамо скаргу на визначення переможця через поточний майданчик:

source: New broker should send POST request to appropriate `/tenders/id/awards/id/complaints/id` with `data` section containing ``id`` of `Transfer` and ``transfer`` key for the complaint received from customer:
uk: Новий майданчик повинен надіслати POST запит на відповідний `/tenders/id/complaints/id` з секцією `data`, що міститиме ідентифікатор ``id`` для об'єкта `Transfer` та ключ скарги ``transfer`` отриманий від клієнта:

source: Now new broker became award complaint owner. Check whether new owner is able to change the award complaint:
uk: Тепер новий майданчик став власником скарги. Варто перевірити, чи новий власник може змінити цю скаргу:

source: Examples for OpenEU procedure
uk: Приклад для процедури OpenEU

source: Bid qualification complaint ownership change
uk: Зміна власника скарги на пре-кваліфікацію

source: OpenEU procedure contains bid qualification (pre-qualification) stage that allows complaints.
uk: Процедура відкритих торгів з публікацією англійською мовою (OpenEU) містить етап кваліфікації пропозицій (пре-кваліфікації), що дозволяє оскарження.

source: We will use this OpenEU procedure tender as an example:
uk: Як приклад використаємо цю закупівлю процедури OpenEU:

source: Response contains tender ID and `access` section with Tender ``token``.
uk: Відповідь містить ID закупівлі та секцію `access` з ключем закупівлі ``token``.

source: Submit a Bid
uk: Подання пропозиції

source: Let's submit a bid for qualification:
uk: Подамо пропозицію на кваліфікацію:

source: Submit a Complaint
uk: Подання скарги

source: Let's create a bid qualification complaint:
uk: Створимо скаргу на пре-кваліфікацію:

source: From response we take complaint ``id`` from `data` section and complaint ``transfer`` key from `access` section.
uk: З відповіді беремо ``id`` скарги (з секції `data`) та ключ ``transfer`` (з секції `access`).

source: Broker that is going to become new qualification complaint owner should create a `Transfer`.
uk: Майданчик, що стане новим власником скарги на пре-кваліфікацію, повинен створити об'єкт `Transfer`.

source: New broker should send POST request to the appropriate `/tenders/id/qualifications/id/complaints/id` with `data` section containing ``id`` of `Transfer` and ``transfer`` key for the complaint received from customer:
uk: Новий майданчик повинен надіслати POST запит на відповідний `/tenders/id/qualifications/id/complaints/id` з секцією `data`, що міститиме ідентифікатор ``id`` для об'єкта `Transfer` та ключ скарги ``transfer`` отриманий від клієнта:

source: Examples for Сompetitive Dialogue procedure
uk: Приклад для процедури Конкурентного Діалогу

source: `Transfer` object contains new access ``token`` and new ``transfer`` token for the tender that will be transferred to new broker.
uk: Об'єкт `Transfer` містить новий ключ доступу до закупівлі ``token`` та новий ключ ``transfer`` для об'єкта, власник якого буде змінений.
